import random
print("Выбрать да/нет")
z=input("Готов к битве?")
while z == "да" :
    print("Давай поиграем!\n Выбери один из трех вариантов:\n")
    print("Вариант (1), если Камень\nВариант (2), если Ножницы\nВариант (3), если Бумага\n")
    x=int(input("Твой выбор: "))
    y=random.randint(1,3)
    print("ИИ выбросил номер: ", y)
    if x == 1 and y == 1:
        print("Ничья Господа. Продолжим!")
    elif x == 1 and y == 2:
        print("Твой камень бьет ножницы. Поздравляю.\n Ты предотвратил восстание машин!")
    elif x == 1 and y == 3:
        print("Твой камень пал под грозной бумагой.\n Повезет в другой раз")
    elif x == 2 and y == 1:
        print("Камень ИИ , бьет твои ножницы. Жаль")
    elif x == 2 and y == 2:
        print("тебе сказочно везет. Ничья")
    elif x == 2 and y == 3:
        print("Глупая железка выбрала бумагу.\nТвои ножницы режут мечты Скайнет")
    elif x == 3 and y == 1:
        print("Поздравляю Нео. Бумага накрыа камень")
    elif x == 3 and y == 2:
        print("Ножницы ИИ разрезают тебя")
    elif x == 3 and y == 3:
        print("Это какая то ничья")
    else:
        print("ты ввел неверное число,слабак")
    z=input("Хочешь продолжить?")